using System;

namespace Ex_3
{
    class Program
    {
     /* Завдання 3. Знайти найдовше слово в реченні.
      Користувач повинен ввести строку.Необхідно зчитати значення
      строки.Розбити строку на масив строк (в якості роздільників
      використовувати пробіл, крапку та кому). Визначити найдовше слово –
      вивести його на екран та кількість символів в ньому.*/
        static void Main(string[] args)
        {
            string n = Console.ReadLine();
            string[] arrayN = { };


            Console.ReadKey();
        }        
    }
}
